---
kind: method
id: M:Autodesk.Revit.DB.Form.CanManipulateSubElement(Autodesk.Revit.DB.Reference)
zh: 对话框、窗口、窗体
source: html/2ec8c922-c412-4ca4-de0d-99dd6c63d54c.htm
---
# Autodesk.Revit.DB.Form.CanManipulateSubElement Method

**中文**: 对话框、窗口、窗体

Tell if a sub element can be deleted/moved/rotated/scaled.

## Syntax (C#)
```csharp
public bool CanManipulateSubElement(
	Reference subElementReference
)
```

## Parameters
- **subElementReference** (`Autodesk.Revit.DB.Reference`) - The geometry reference of face/edge/curve/vertex